[Survived] StringLiteral
src/App.tsx:6:58
 import LiveScore, { LiveScoreProps } from "./components/LiveScore/LiveScore";
 
 function App() {
-    const [matchPhase, setMatchPhase] = useState<string>('pre_match');
+    const [matchPhase, setMatchPhase] = useState<string>("");
 
     const liveScoreProps: LiveScoreProps = {

[Survived] ArrowFunction
src/App.tsx:9:24
     const [matchPhase, setMatchPhase] = useState<string>('pre_match');
 
     const liveScoreProps: LiveScoreProps = {
-        onPhaseChange: (newPhase: string) => setMatchPhase(newPhase)
+        onPhaseChange: () => undefined
     }
 

[Survived] ConditionalExpression
src/App.tsx:12:31
         onPhaseChange: (newPhase: string) => setMatchPhase(newPhase)
     }
 
-    const rotatingWhenMatch = matchPhase === 'match' ? 'rotating' : '';
+    const rotatingWhenMatch = true ? 'rotating' : '';
     const color = matchPhase === 'pre_match' ? 'yellow'
         : matchPhase === 'match' ? 'green'

[Timeout] ConditionalExpression
src/App.tsx:12:31
         onPhaseChange: (newPhase: string) => setMatchPhase(newPhase)
     }
 
-    const rotatingWhenMatch = matchPhase === 'match' ? 'rotating' : '';
+    const rotatingWhenMatch = false ? 'rotating' : '';
     const color = matchPhase === 'pre_match' ? 'yellow'
         : matchPhase === 'match' ? 'green'

[Survived] ConditionalExpression
src/App.tsx:13:19
     }
 
     const rotatingWhenMatch = matchPhase === 'match' ? 'rotating' : '';
-    const color = matchPhase === 'pre_match' ? 'yellow'
+    const color = false ? 'yellow'
         : matchPhase === 'match' ? 'green'
         : matchPhase === 'post_match' ? 'red'

[Survived] ConditionalExpression
src/App.tsx:13:19
     }
 
     const rotatingWhenMatch = matchPhase === 'match' ? 'rotating' : '';
-    const color = matchPhase === 'pre_match' ? 'yellow'
+    const color = true ? 'yellow'
         : matchPhase === 'match' ? 'green'
         : matchPhase === 'post_match' ? 'red'

[Timeout] ConditionalExpression
src/App.tsx:14:11
 
     const rotatingWhenMatch = matchPhase === 'match' ? 'rotating' : '';
     const color = matchPhase === 'pre_match' ? 'yellow'
-        : matchPhase === 'match' ? 'green'
+        : true ? 'green'
         : matchPhase === 'post_match' ? 'red'
         : 'black';

[Survived] ConditionalExpression
src/App.tsx:14:11
 
     const rotatingWhenMatch = matchPhase === 'match' ? 'rotating' : '';
     const color = matchPhase === 'pre_match' ? 'yellow'
-        : matchPhase === 'match' ? 'green'
+        : false ? 'green'
         : matchPhase === 'post_match' ? 'red'
         : 'black';

[NoCoverage] ConditionalExpression
src/App.tsx:15:11
     const rotatingWhenMatch = matchPhase === 'match' ? 'rotating' : '';
     const color = matchPhase === 'pre_match' ? 'yellow'
         : matchPhase === 'match' ? 'green'
-        : matchPhase === 'post_match' ? 'red'
+        : false ? 'red'
         : 'black';
 

[NoCoverage] EqualityOperator
src/App.tsx:15:11
     const rotatingWhenMatch = matchPhase === 'match' ? 'rotating' : '';
     const color = matchPhase === 'pre_match' ? 'yellow'
         : matchPhase === 'match' ? 'green'
-        : matchPhase === 'post_match' ? 'red'
+        : matchPhase !== 'post_match' ? 'red'
         : 'black';
 

[NoCoverage] StringLiteral
src/App.tsx:16:11
     const color = matchPhase === 'pre_match' ? 'yellow'
         : matchPhase === 'match' ? 'green'
         : matchPhase === 'post_match' ? 'red'
-        : 'black';
+        : "";
 
     return (

[Survived] StringLiteral
src/App.tsx:28:37
                         <path fill="currentColor"
                     </svg>
-                    <svg className={`logo ball ${rotatingWhenMatch}`}
+                    <svg className={``}
                          xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1200 1200">
                         <path fill="none" d="M0 0h1200v1200H0z"/>
