[Survived] BlockStatement
src/components/LiveScore/LiveScore.tsx:34:27
 const LiveScore: React.FC<LiveScoreProps> = ({ onPhaseChange }) => {
     const { liveScores, error, loading } = useLiveScore();
 
-    React.useEffect(() => {
-        if (onPhaseChange && liveScores?.phase) {
-            onPhaseChange(liveScores.phase);
-        }
-    }, [liveScores?.phase, onPhaseChange]);
+    React.useEffect(() => {}, [liveScores?.phase, onPhaseChange]);
 
     if (loading)

[Survived] BlockStatement
src/components/LiveScore/LiveScore.tsx:35:49
     const { liveScores, error, loading } = useLiveScore();
 
     React.useEffect(() => {
-        if (onPhaseChange && liveScores?.phase) {
-            onPhaseChange(liveScores.phase);
-        }
+        if (onPhaseChange && liveScores?.phase) {}
     }, [liveScores?.phase, onPhaseChange]);
 

[Survived] ArrayDeclaration
src/components/LiveScore/LiveScore.tsx:38:8
         if (onPhaseChange && liveScores?.phase) {
             onPhaseChange(liveScores.phase);
         }
-    }, [liveScores?.phase, onPhaseChange]);
+    }, []);
 
     if (loading)

[Timeout] ConditionalExpression
src/components/LiveScore/LiveScore.tsx:40:9
         }
     }, [liveScores?.phase, onPhaseChange]);
 
-    if (loading)
+    if (false)
         return <div>Loading...</div>;
 

[Killed] ConditionalExpression
src/components/LiveScore/LiveScore.tsx:43:9
     if (loading)
         return <div>Loading...</div>;
 
-    if (error)
+    if (false)
         return <div>Error: {error}</div>;
 
killedBy: LiveScore displays an error message if there is an error
statusReason: TestingLibraryElementError: Unable to find an element with the text: Error: Network Error. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      No live scores available.
    </div>

[Killed] ConditionalExpression
src/components/LiveScore/LiveScore.tsx:52:64
     return (
         <LiveScoreContainer data-testid="LiveScore" aria-live="polite" aria-label="Live score updates">
             {liveScores.matches.map((match) => {
-                const homeTeam = liveScores.teams.find(team => team.team_id === match.home_team_id);
+                const homeTeam = liveScores.teams.find(team => true);
                 const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
                 const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
killedBy: LiveScore renders details of live scores correctly once data is fetched
statusReason: Error: Found multiple elements with the alt text: Crest of VL Lisbon

Here are the matching elements:

Ignored nodes: comments, script, style
<img
  alt="Crest of VL Lisbon"
  class="sc-guDLey lecgcF"

[Killed] ConditionalExpression
src/components/LiveScore/LiveScore.tsx:52:64
     return (
         <LiveScoreContainer data-testid="LiveScore" aria-live="polite" aria-label="Live score updates">
             {liveScores.matches.map((match) => {
-                const homeTeam = liveScores.teams.find(team => team.team_id === match.home_team_id);
+                const homeTeam = liveScores.teams.find(team => false);
                 const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
                 const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
killedBy: LiveScore renders all live scores once data is fetched
statusReason: Error: Unable to find an element by: [data-testid="MatchRow"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Live score updates"
      aria-live="polite"

[Killed] ArrowFunction
src/components/LiveScore/LiveScore.tsx:53:56
         <LiveScoreContainer data-testid="LiveScore" aria-live="polite" aria-label="Live score updates">
             {liveScores.matches.map((match) => {
                 const homeTeam = liveScores.teams.find(team => team.team_id === match.home_team_id);
-                const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
+                const awayTeam = liveScores.teams.find(() => undefined);
                 const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
                 const homeScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'home').length;
killedBy: LiveScore renders all live scores once data is fetched
statusReason: Error: Unable to find an element by: [data-testid="MatchRow"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Live score updates"
      aria-live="polite"

[Killed] EqualityOperator
src/components/LiveScore/LiveScore.tsx:53:64
         <LiveScoreContainer data-testid="LiveScore" aria-live="polite" aria-label="Live score updates">
             {liveScores.matches.map((match) => {
                 const homeTeam = liveScores.teams.find(team => team.team_id === match.home_team_id);
-                const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
+                const awayTeam = liveScores.teams.find(team => team.team_id !== match.away_team_id);
                 const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
                 const homeScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'home').length;
killedBy: LiveScore renders details of live scores correctly once data is fetched
statusReason: Error: Found multiple elements with the alt text: Crest of VL Lisbon

Here are the matching elements:

Ignored nodes: comments, script, style
<img
  alt="Crest of VL Lisbon"
  class="sc-guDLey lecgcF"

[Killed] MethodExpression
src/components/LiveScore/LiveScore.tsx:54:37
             {liveScores.matches.map((match) => {
                 const homeTeam = liveScores.teams.find(team => team.team_id === match.home_team_id);
                 const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
-                const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
+                const matchEvents = liveScores.events;
                 const homeScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'home').length;
                 const awayScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'away').length;
killedBy: LiveScore renders details of live scores correctly once data is fetched
statusReason: Error: Unable to find an element with the text: 1:0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Live score updates"
      aria-live="polite"

[Killed] ArrowFunction
src/components/LiveScore/LiveScore.tsx:54:62
             {liveScores.matches.map((match) => {
                 const homeTeam = liveScores.teams.find(team => team.team_id === match.home_team_id);
                 const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
-                const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
+                const matchEvents = liveScores.events.filter(() => undefined);
                 const homeScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'home').length;
                 const awayScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'away').length;
killedBy: LiveScore renders details of live scores correctly once data is fetched
statusReason: Error: Unable to find an element with the text: 1:0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Live score updates"
      aria-live="polite"

[Killed] MethodExpression
src/components/LiveScore/LiveScore.tsx:55:35
                 const homeTeam = liveScores.teams.find(team => team.team_id === match.home_team_id);
                 const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
                 const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
-                const homeScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'home').length;
+                const homeScore = matchEvents.length;
                 const awayScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'away').length;
 
killedBy: LiveScore renders details of live scores correctly once data is fetched
statusReason: Error: Unable to find an element with the text: 1:0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Live score updates"
      aria-live="polite"

[Killed] ConditionalExpression
src/components/LiveScore/LiveScore.tsx:55:94
                 const homeTeam = liveScores.teams.find(team => team.team_id === match.home_team_id);
                 const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
                 const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
-                const homeScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'home').length;
+                const homeScore = matchEvents.filter(event => event.event_type === 'goal' && true).length;
                 const awayScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'away').length;
 
killedBy: LiveScore renders details of live scores correctly once data is fetched
statusReason: TestingLibraryElementError: Unable to find an element with the text: 0:1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="sc-hLQSwg kvGumC"
  data-testid="MatchRow"
>
  <div

[Killed] LogicalOperator
src/components/LiveScore/LiveScore.tsx:56:63
                 const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
                 const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
                 const homeScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'home').length;
-                const awayScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'away').length;
+                const awayScore = matchEvents.filter(event => event.event_type === 'goal' || event.score_team === 'away').length;
 
                 if (!homeTeam || !awayTeam)
killedBy: LiveScore renders details of live scores correctly once data is fetched
statusReason: Error: Unable to find an element with the text: 1:0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-label="Live score updates"
      aria-live="polite"

[Killed] EqualityOperator
src/components/LiveScore/LiveScore.tsx:56:63
                 const awayTeam = liveScores.teams.find(team => team.team_id === match.away_team_id);
                 const matchEvents = liveScores.events.filter(event => event.match_id === match.match_id);
                 const homeScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'home').length;
-                const awayScore = matchEvents.filter(event => event.event_type === 'goal' && event.score_team === 'away').length;
+                const awayScore = matchEvents.filter(event => event.event_type !== 'goal' && event.score_team === 'away').length;
 
                 if (!homeTeam || !awayTeam)
killedBy: LiveScore renders details of live scores correctly once data is fetched
statusReason: TestingLibraryElementError: Unable to find an element with the text: 0:1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="sc-hLQSwg kvGumC"
  data-testid="MatchRow"
>
  <div
