[Timeout] StringLiteral
src/components/ScoreBox/ScoreBox.tsx:13:76
 
 const animationDuration = 2000; // 2s
 
-const Box = styled.div<{ $animate: boolean; $showFootball: 'home'|'away' }>`
-    line-height: 100%;
-    
-    position: relative;
-    display: flex;
-    justify-content: center;
-    align-items: center;
-    
-    background-color: #00a5e1; // https://pickcoloronline.com/
-    color: white;
-    padding: var(--spacingY) var(--spacingX);
-
-    animation: ${({ $animate }) => $animate ? `goalScored ${animationDuration}ms ease-out forwards` : 'none'};
-
-    .football-icon {
-        position: absolute;
-        height: 1.5em;
-        width: auto;
-        opacity: 0;
-        ${({ $showFootball }) =>
-                $showFootball === 'home' ? 'left: -1.5em;'
-                : $showFootball === 'away' ? 'right: -1.5em;'
-                : ''}
-    }
-`;
+const Box = styled.div<{ $animate: boolean; $showFootball: 'home'|'away' }>``;
 
 const ScoreBox: React.FC<ScoreBoxProps> = ({ homeScore, awayScore }) => {

[Timeout] ArrowFunction
src/components/ScoreBox/ScoreBox.tsx:25:18
     color: white;
     padding: var(--spacingY) var(--spacingX);
 
-    animation: ${({ $animate }) => $animate ? `goalScored ${animationDuration}ms ease-out forwards` : 'none'};
+    animation: ${() => undefined};
 
     .football-icon {

[Timeout] StringLiteral
src/components/ScoreBox/ScoreBox.tsx:25:47
     color: white;
     padding: var(--spacingY) var(--spacingX);
 
-    animation: ${({ $animate }) => $animate ? `goalScored ${animationDuration}ms ease-out forwards` : 'none'};
+    animation: ${({ $animate }) => $animate ? `` : 'none'};
 
     .football-icon {

[Timeout] ArrowFunction
src/components/ScoreBox/ScoreBox.tsx:32:11
         height: 1.5em;
         width: auto;
         opacity: 0;
-        ${({ $showFootball }) =>
-                $showFootball === 'home' ? 'left: -1.5em;'
-                : $showFootball === 'away' ? 'right: -1.5em;'
-                : ''}
+        ${() => undefined}
     }
 `;

[Timeout] ConditionalExpression
src/components/ScoreBox/ScoreBox.tsx:33:17
         width: auto;
         opacity: 0;
         ${({ $showFootball }) =>
-                $showFootball === 'home' ? 'left: -1.5em;'
+                true ? 'left: -1.5em;'
                 : $showFootball === 'away' ? 'right: -1.5em;'
                 : ''}

[Timeout] ConditionalExpression
src/components/ScoreBox/ScoreBox.tsx:33:17
         width: auto;
         opacity: 0;
         ${({ $showFootball }) =>
-                $showFootball === 'home' ? 'left: -1.5em;'
+                false ? 'left: -1.5em;'
                 : $showFootball === 'away' ? 'right: -1.5em;'
                 : ''}

[NoCoverage] EqualityOperator
src/components/ScoreBox/ScoreBox.tsx:34:19
         opacity: 0;
         ${({ $showFootball }) =>
                 $showFootball === 'home' ? 'left: -1.5em;'
-                : $showFootball === 'away' ? 'right: -1.5em;'
+                : $showFootball !== 'away' ? 'right: -1.5em;'
                 : ''}
     }

[NoCoverage] ConditionalExpression
src/components/ScoreBox/ScoreBox.tsx:34:19
         opacity: 0;
         ${({ $showFootball }) =>
                 $showFootball === 'home' ? 'left: -1.5em;'
-                : $showFootball === 'away' ? 'right: -1.5em;'
+                : true ? 'right: -1.5em;'
                 : ''}
     }

[NoCoverage] StringLiteral
src/components/ScoreBox/ScoreBox.tsx:35:19
         ${({ $showFootball }) =>
                 $showFootball === 'home' ? 'left: -1.5em;'
                 : $showFootball === 'away' ? 'right: -1.5em;'
-                : ''}
+                : "Stryker was here!"}
     }
 `;

[Timeout] BooleanLiteral
src/components/ScoreBox/ScoreBox.tsx:40:44
 `;
 
 const ScoreBox: React.FC<ScoreBoxProps> = ({ homeScore, awayScore }) => {
-    const [animate, setAnimate] = useState(false);
+    const [animate, setAnimate] = useState(true);
     const [previousScores, setPreviousScores] = useState({ homeScore, awayScore });
     const [scoreChanged, setScoreChanged] = useState(false);

[Timeout] BooleanLiteral
src/components/ScoreBox/ScoreBox.tsx:42:54
 const ScoreBox: React.FC<ScoreBoxProps> = ({ homeScore, awayScore }) => {
     const [animate, setAnimate] = useState(false);
     const [previousScores, setPreviousScores] = useState({ homeScore, awayScore });
-    const [scoreChanged, setScoreChanged] = useState(false);
+    const [scoreChanged, setScoreChanged] = useState(true);
     const [lastScorer, setLastScorer] = useState<'home' | 'away'>('home');
     const [showFootballIcon, setShowFootballIcon] = useState(false);

[Timeout] BooleanLiteral
src/components/ScoreBox/ScoreBox.tsx:44:62
     const [previousScores, setPreviousScores] = useState({ homeScore, awayScore });
     const [scoreChanged, setScoreChanged] = useState(false);
     const [lastScorer, setLastScorer] = useState<'home' | 'away'>('home');
-    const [showFootballIcon, setShowFootballIcon] = useState(false);
+    const [showFootballIcon, setShowFootballIcon] = useState(true);
 
     useEffect(() => {

[Timeout] BlockStatement
src/components/ScoreBox/ScoreBox.tsx:46:21
     const [lastScorer, setLastScorer] = useState<'home' | 'away'>('home');
     const [showFootballIcon, setShowFootballIcon] = useState(false);
 
-    useEffect(() => {
-        if (homeScore === previousScores.homeScore && awayScore === previousScores.awayScore)
-            return;
-
-        setScoreChanged(true);
-        setAnimate(true);
-        setLastScorer(homeScore !== previousScores.homeScore ? 'home' : 'away');
-        setShowFootballIcon(true);
-    }, [homeScore, awayScore, previousScores.homeScore, previousScores.awayScore]);
+    useEffect(() => {}, [homeScore, awayScore, previousScores.homeScore, previousScores.awayScore]);
 
     useEffect(() => {

[Timeout] EqualityOperator
src/components/ScoreBox/ScoreBox.tsx:47:55
     const [showFootballIcon, setShowFootballIcon] = useState(false);
 
     useEffect(() => {
-        if (homeScore === previousScores.homeScore && awayScore === previousScores.awayScore)
+        if (homeScore === previousScores.homeScore && awayScore !== previousScores.awayScore)
             return;
 

[Timeout] ConditionalExpression
src/components/ScoreBox/ScoreBox.tsx:47:55
     const [showFootballIcon, setShowFootballIcon] = useState(false);
 
     useEffect(() => {
-        if (homeScore === previousScores.homeScore && awayScore === previousScores.awayScore)
+        if (homeScore === previousScores.homeScore && true)
             return;
 

[Timeout] BooleanLiteral
src/components/ScoreBox/ScoreBox.tsx:50:25
         if (homeScore === previousScores.homeScore && awayScore === previousScores.awayScore)
             return;
 
-        setScoreChanged(true);
+        setScoreChanged(false);
         setAnimate(true);
         setLastScorer(homeScore !== previousScores.homeScore ? 'home' : 'away');

[Timeout] BooleanLiteral
src/components/ScoreBox/ScoreBox.tsx:51:20
             return;
 
         setScoreChanged(true);
-        setAnimate(true);
+        setAnimate(false);
         setLastScorer(homeScore !== previousScores.homeScore ? 'home' : 'away');
         setShowFootballIcon(true);

[Timeout] ConditionalExpression
src/components/ScoreBox/ScoreBox.tsx:52:23
 
         setScoreChanged(true);
         setAnimate(true);
-        setLastScorer(homeScore !== previousScores.homeScore ? 'home' : 'away');
+        setLastScorer(true ? 'home' : 'away');
         setShowFootballIcon(true);
     }, [homeScore, awayScore, previousScores.homeScore, previousScores.awayScore]);

[Timeout] ConditionalExpression
src/components/ScoreBox/ScoreBox.tsx:52:23
 
         setScoreChanged(true);
         setAnimate(true);
-        setLastScorer(homeScore !== previousScores.homeScore ? 'home' : 'away');
+        setLastScorer(false ? 'home' : 'away');
         setShowFootballIcon(true);
     }, [homeScore, awayScore, previousScores.homeScore, previousScores.awayScore]);

[Timeout] BooleanLiteral
src/components/ScoreBox/ScoreBox.tsx:53:29
         setScoreChanged(true);
         setAnimate(true);
         setLastScorer(homeScore !== previousScores.homeScore ? 'home' : 'away');
-        setShowFootballIcon(true);
+        setShowFootballIcon(false);
     }, [homeScore, awayScore, previousScores.homeScore, previousScores.awayScore]);
 

[Timeout] BlockStatement
src/components/ScoreBox/ScoreBox.tsx:56:21
         setShowFootballIcon(true);
     }, [homeScore, awayScore, previousScores.homeScore, previousScores.awayScore]);
 
-    useEffect(() => {
-        if (!scoreChanged)
-            return;
-
-        const timeoutId = setTimeout(() => {
-            setScoreChanged(false);
-            setAnimate(false);
-            setPreviousScores({ homeScore, awayScore });
-            setShowFootballIcon(false);
-        }, animationDuration);
-
-        return () => clearTimeout(timeoutId);
-    }, [scoreChanged, homeScore, awayScore]);
+    useEffect(() => {}, [scoreChanged, homeScore, awayScore]);
 
     const score = `${homeScore}:${awayScore}`;

[Timeout] ConditionalExpression
src/components/ScoreBox/ScoreBox.tsx:57:13
     }, [homeScore, awayScore, previousScores.homeScore, previousScores.awayScore]);
 
     useEffect(() => {
-        if (!scoreChanged)
+        if (false)
             return;
 

[Timeout] ConditionalExpression
src/components/ScoreBox/ScoreBox.tsx:57:13
     }, [homeScore, awayScore, previousScores.homeScore, previousScores.awayScore]);
 
     useEffect(() => {
-        if (!scoreChanged)
+        if (true)
             return;
 

[Timeout] BlockStatement
src/components/ScoreBox/ScoreBox.tsx:60:44
         if (!scoreChanged)
             return;
 
-        const timeoutId = setTimeout(() => {
-            setScoreChanged(false);
-            setAnimate(false);
-            setPreviousScores({ homeScore, awayScore });
-            setShowFootballIcon(false);
-        }, animationDuration);
+        const timeoutId = setTimeout(() => {}, animationDuration);
 
         return () => clearTimeout(timeoutId);

[Timeout] BooleanLiteral
src/components/ScoreBox/ScoreBox.tsx:61:29
             return;
 
         const timeoutId = setTimeout(() => {
-            setScoreChanged(false);
+            setScoreChanged(true);
             setAnimate(false);
             setPreviousScores({ homeScore, awayScore });

[Timeout] BooleanLiteral
src/components/ScoreBox/ScoreBox.tsx:62:24
 
         const timeoutId = setTimeout(() => {
             setScoreChanged(false);
-            setAnimate(false);
+            setAnimate(true);
             setPreviousScores({ homeScore, awayScore });
             setShowFootballIcon(false);

[Timeout] BooleanLiteral
src/components/ScoreBox/ScoreBox.tsx:64:33
             setScoreChanged(false);
             setAnimate(false);
             setPreviousScores({ homeScore, awayScore });
-            setShowFootballIcon(false);
+            setShowFootballIcon(true);
         }, animationDuration);
 

[Timeout] ArrowFunction
src/components/ScoreBox/ScoreBox.tsx:67:16
             setShowFootballIcon(false);
         }, animationDuration);
 
-        return () => clearTimeout(timeoutId);
+        return () => undefined;
     }, [scoreChanged, homeScore, awayScore]);
 

[Timeout] ArrayDeclaration
src/components/ScoreBox/ScoreBox.tsx:68:8
         }, animationDuration);
 
         return () => clearTimeout(timeoutId);
-    }, [scoreChanged, homeScore, awayScore]);
+    }, []);
 
     const score = `${homeScore}:${awayScore}`;

[Timeout] StringLiteral
src/components/ScoreBox/ScoreBox.tsx:70:19
         return () => clearTimeout(timeoutId);
     }, [scoreChanged, homeScore, awayScore]);
 
-    const score = `${homeScore}:${awayScore}`;
+    const score = ``;
     return (
         <Box data-testid="ScoreBox" $animate={animate} $showFootball={lastScorer}>

[Timeout] StringLiteral
src/components/ScoreBox/ScoreBox.tsx:75:65
         <Box data-testid="ScoreBox" $animate={animate} $showFootball={lastScorer}>
             <img src={footballIcon}
                  alt="Football icon"
-                 className={`football-icon ${showFootballIcon ? 'show-and-fade' : ''}`} />
+                 className={`football-icon ${showFootballIcon ? "" : ''}`} />
             {score}
         </Box>
