[Timeout] StringLiteral
src/components/TeamCrest/TeamCrest.tsx:12:69
     orientation: 'left' | 'right';
 }
 
-const CrestContainer = styled.div<{ orientation: 'left' | 'right' }>`
-    display: flex;
-    flex-direction: ${({ orientation }) => orientation === 'right' ? 'row-reverse' : 'row'};
-    align-items: center;
-    justify-content: flex-end;
-    gap: var(--spacingX);
-`;
+const CrestContainer = styled.div<{ orientation: 'left' | 'right' }>``;
 
 const CrestImage = styled.img`

[Timeout] ArrowFunction
src/components/TeamCrest/TeamCrest.tsx:14:23
 
 const CrestContainer = styled.div<{ orientation: 'left' | 'right' }>`
     display: flex;
-    flex-direction: ${({ orientation }) => orientation === 'right' ? 'row-reverse' : 'row'};
+    flex-direction: ${() => undefined};
     align-items: center;
     justify-content: flex-end;

[Timeout] EqualityOperator
src/components/TeamCrest/TeamCrest.tsx:14:44
 
 const CrestContainer = styled.div<{ orientation: 'left' | 'right' }>`
     display: flex;
-    flex-direction: ${({ orientation }) => orientation === 'right' ? 'row-reverse' : 'row'};
+    flex-direction: ${({ orientation }) => orientation !== 'right' ? 'row-reverse' : 'row'};
     align-items: center;
     justify-content: flex-end;

[Timeout] StringLiteral
src/components/TeamCrest/TeamCrest.tsx:27:114
 
 const TeamCrest: React.FC<TeamCrestProps> = ({ abbreviation, crestSrc, name, orientation }) => {
     return (
-        <CrestContainer orientation={orientation} data-testid={`TeamCrest${capitalize(orientation)}`} className={`orientation-${orientation}`}>
+        <CrestContainer orientation={orientation} data-testid={`TeamCrest${capitalize(orientation)}`} className={``}>
             <span>{abbreviation}</span>
             <CrestImage src={crestSrc} alt={`Crest of ${name}`} />
