[Timeout] BooleanLiteral
src/hooks/useLiveScore.ts:7:53
 const useLiveScore = () => {
     const [liveScores, setLiveScores] = useState<LiveScoreResponse | null>(null);
     const [error, setError] = useState<string | null>(null);
-    const [loading, setLoading] = useState<boolean>(true);
+    const [loading, setLoading] = useState<boolean>(false);
 
     useEffect(() => {

[Timeout] BlockStatement
src/hooks/useLiveScore.ts:12:43
     useEffect(() => {
         let isMounted = true;
 
-        const getLiveScores = async () => {
-            try {
-                const data = await fetchLiveScores();
-                if (isMounted) {
-                    setLiveScores(data);
-                    setLoading(false);
-                }
-            } catch (e) {
-                if (e instanceof Error) {
-                    setError(e.message);
-                } else {
-                    setError('An unknown error occurred');
-                }
-                setLoading(false);
-            }
-        };
+        const getLiveScores = async () => {};
 
         getLiveScores();

[Killed] BlockStatement
src/hooks/useLiveScore.ts:13:17
         let isMounted = true;
 
         const getLiveScores = async () => {
-            try {
-                const data = await fetchLiveScores();
-                if (isMounted) {
-                    setLiveScores(data);
-                    setLoading(false);
-                }
-            } catch (e) {
+            try {} catch (e) {
                 if (e instanceof Error) {
                     setError(e.message);
killedBy: renders learn LiveScore component
statusReason: Error: Unable to find an element by: [data-testid="LiveScore"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="App"
    >

[Killed] BlockStatement
src/hooks/useLiveScore.ts:15:32
         const getLiveScores = async () => {
             try {
                 const data = await fetchLiveScores();
-                if (isMounted) {
-                    setLiveScores(data);
-                    setLoading(false);
-                }
+                if (isMounted) {}
             } catch (e) {
                 if (e instanceof Error) {
killedBy: useLiveScore should fetch live scores
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/hooks/useLiveScore.ts:15:21
         const getLiveScores = async () => {
             try {
                 const data = await fetchLiveScores();
-                if (isMounted) {
+                if (false) {
                     setLiveScores(data);
                     setLoading(false);
killedBy: useLiveScore should fetch live scores
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

Ignored nodes: comments, script, style
<html>
  <head />

[Timeout] BooleanLiteral
src/hooks/useLiveScore.ts:17:32
                 const data = await fetchLiveScores();
                 if (isMounted) {
                     setLiveScores(data);
-                    setLoading(false);
+                    setLoading(true);
                 }
             } catch (e) {

[NoCoverage] BlockStatement
src/hooks/useLiveScore.ts:19:25
                     setLiveScores(data);
                     setLoading(false);
                 }
-            } catch (e) {
-                if (e instanceof Error) {
-                    setError(e.message);
-                } else {
-                    setError('An unknown error occurred');
-                }
-                setLoading(false);
-            }
+            } catch (e) {}
         };
 

[NoCoverage] BlockStatement
src/hooks/useLiveScore.ts:20:41
                     setLoading(false);
                 }
             } catch (e) {
-                if (e instanceof Error) {
-                    setError(e.message);
-                } else {
+                if (e instanceof Error) {} else {
                     setError('An unknown error occurred');
                 }

[NoCoverage] BlockStatement
src/hooks/useLiveScore.ts:22:24
             } catch (e) {
                 if (e instanceof Error) {
                     setError(e.message);
-                } else {
-                    setError('An unknown error occurred');
-                }
+                } else {}
                 setLoading(false);
             }

[Timeout] BlockStatement
src/hooks/useLiveScore.ts:32:22
         getLiveScores();
         const intervalId = setInterval(getLiveScores, 2000);
 
-        return () => {
-            isMounted = false;
-            clearInterval(intervalId);
-        };
+        return () => {};
     }, []);
 

[Timeout] ArrayDeclaration
src/hooks/useLiveScore.ts:36:8
             isMounted = false;
             clearInterval(intervalId);
         };
-    }, []);
+    }, ["Stryker was here"]);
 
     return { liveScores, error, loading };
