[Timeout] StringLiteral
src/services/api.ts:3:17
 import axios from 'axios';
 
-const API_URL = 'http://vgcommonstaging.aitcloud.de/livescore/';
+const API_URL = "";
 
 export type LiveScoreResponse = {

[NoCoverage] StringLiteral
src/services/api.ts:39:29
             throw new Error('Error fetching live scores.');
         } else {
             console.error('Unexpected error fetching live scores:', error);
-            throw new Error('Error fetching live scores.');
+            throw new Error("");
         }
     }
