[Timeout] MethodExpression
src/utils/stringUtils.ts:1:46
-export const capitalize = (s: string) => s ? s[0].toUpperCase() + s.slice(1) : '';
+export const capitalize = (s: string) => s ? s[0].toLowerCase() + s.slice(1) : '';
 

[Timeout] MethodExpression
src/utils/stringUtils.ts:1:67
-export const capitalize = (s: string) => s ? s[0].toUpperCase() + s.slice(1) : '';
+export const capitalize = (s: string) => s ? s[0].toUpperCase() + s : '';
 
